<template>
  <section
    id="coaches"
    class="block-content"
  >
    <h2>Тренировки под руководством экспертов</h2>

    <div class="coaches">
      <article class="coach">
        <div class="person-image">
          <img src="/images/Dmitry.jpeg" alt="Dmitry">
        </div>
        <div class="block-content">
          <h3>Дмитрий</h3>
          <h4>Персональный тренер. Владелец студии</h4>

          <p class="regalia">КМС Пауэрлифтинг классический (ФПР)</p>
          <p class="regalia">МС Подъем штанги на бицепс (СПР)</p>
          <p class="regalia">КМС Пауэрспорт (СПР)</p>

          <p>
            ― “Я люблю свою работу. Сделаю всё, чтобы улучшить ваше качество жизни и здоровье,
            увеличить выносливость, силу и мышечную массу, приобрести красивую стройную фигуру.”
          </p>
          <p>
            ― “Занимайтесь спортом 😉”
          </p>
        </div>
      </article>

      <article class="coach">
        <div class="person-image">
          <img src="/images/Grigory.jpeg" alt="Grigory">
        </div>
        <div class="block-content">
          <h3>Григорий</h3>
          <h4>Персональный тренер</h4>

          <p>
            ― “В работе с каждым своим подопечным подбираю индивидуальный план тренировок
            и питания, который в дальнейшем приводит к намеченным результатам!”
          </p>
          <p>
            ― “Если ваша задача: похудеть, просушиться, набрать мышечную массу,
            улучшить выносливость, силовые показатели и укрепить здоровье, то я вас
            жду к себе на индивидуальные тренировки!”
          </p>
          <p>
            ― “Давайте сделаем лучшую форму в вашей жизни!”
          </p>
        </div>
      </article>

      <article class="coach">
        <div class="person-image">
          <img src="/images/Elena.jpeg" alt="Elena">
        </div>
        <div class="block-content">
          <h3>Елена</h3>
          <h4>Инструктор по направлению пилатес, стрейчинг, миофасциальный релиз</h4>

          <p>
            ― “МФР + стрейчинг. Улучшим лимфоток, скольжение тканей, устраним симптомы мышечного
            перенапряжения, особенно после интенсивных тренировок в тренажёрном зале.
            Скоординируем работу тела мягко и корректно.”
          </p>
          <p>
            ― “Регулярные занятия пилатес помогут:
            Избавиться от боли в шее, спине, суставах.
            Улучшить вашу осанку, возвратить суставам силу, гибкость и пластичность,
            создать нужный тонус мышцам.”
          </p>
        </div>
      </article>

      <article class="coach">
        <div class="person-image">
          <img src="/images/Victoria.jpeg" alt="Victoria">
        </div>
        <div class="block-content">
          <h3>Виктория</h3>
          <h4>Учитель по хатха-йоге, йогатерапии</h4>

          <p>
            ― “Йогу давно уже рекомендуют не только тренеры, но и врачи. Абсолютно всем. Она
            помогает нам достичь баланса силы, выносливости и гибкости, работая сразу на все
            системы в теле.”
          </p>
          <p>
            ― “Также, с помощью регулярных тренировок по йоге можно наладить работу мыщц и костей,
            научиться правильно дышать и добавить телу легкости, подвижности.”
          </p>
          <p>
            ― “Берегите тело, в котором живет Ваша душа.”
          </p>
        </div>
      </article>
    </div>
  </section>
</template>

<script>
export default {
  name: 'CoachesBlock',
};
</script>

<style lang="scss" scoped>
.coaches {
  display: flex;
  flex-direction: row;
  flex-wrap: wrap;
  padding: 40px 0;

  .coach {
    width: 50%;
    min-width: 580px;
    display: flex;
    margin-bottom: 48px;

    h3 {
      color: #F55151;
    }

    h4 {
      margin-bottom: 16px;
    }

    p {
      font-style: italic;
    }

    .regalia {
      font-style: normal;
      color: #F55151;
    }

    .person-image {
      position: relative;

      &:before {
        position: absolute;
        display: block;
        content: "";
        top: -15px;
        left: -15px;
        height: 30px;
        width: 30px;
        background-color: #f55151c0;
      }
    }

    img {
      position: relative;
      width: 250px;
      aspect-ratio: auto;
      align-self: start;
      z-index: 10;
    }
  }
}
</style>
